Para começar, primeiro precisamos importar as seguintes bibliotecas:

Pandas: para saber mais: https://medium.com/data-hackers/uma-introdu%C3%A7%C3%A3o-simples-ao-pandas-1e15eea37fa1 / https://pandas.pydata.org/

Numpy: http://www.numpy.org/

In [1]:
import pandas as pd
import numpy as np

Após importar as duas bibliotecas você pode: importar o seu dataset (bando de dados) ou construir um dentro 
do próprio Jupyter. 

Vou importar um dataset e transformá-lo em dataframe.

DataFrame: Um data frame é semelhante a uma matriz mas as suas colunas têm nomes e podem conter dados de tipo diferente. Um data frame pode ser visto como uma tabela de uma base de dados, em que cada linha corresponde a um registo (linha) da tabela. (http://www.dcc.fc.up.pt/~ltorgo/SebentaR/HTML/node16.html) 

aqui as linhas e as colunas são os axis. O Axis = 0 é a coluna e o axis = 1 é a linha

In [2]:
df = pd.read_csv('Pasta1.csv',sep=';', decimal=',', encoding="cp1252")

A gente usa o comando read_ para ler o arquivo que estamos abrindo + a extensão em que ele é salvo.

Como estamos usando o windows e às vezes as coisas dão pau, a gente usa a linha:

sep=';',encoding="cp1252"

onde falamos que o separador (sep) é o ; e o encoding é o cp1252 (windonws) ou UTF-8 (para os demais)

colocamos também o decimal =',' para que ele entenda que a , (nativos em portugues) é o da casa decimal. 

Encoding = responsável por codificar um codepoint em bytes - ou seja desconfigura as vezes de um para o outro, sobre tudo de windows pro resto

In [3]:
df #traz o df inteiro

,ID,estado Origem,IDADE,escolaridade,Trabalha como Programadora,Renda Mensal
0,1,SP,36,4,S,3737.52
1,2,SP,25,2,N,400.00
2,3,MG,34,3,S,2366.14
3,4,RJ,23,3,S,2841.29
4,5,SP,31,4,N,800.00
5,6,SP,34,5,S,3433.02
6,7,SP,39,5,S,2752.74
7,8,PE,24,3,S,3682.33
8,9,RJ,29,3,S,2359.28
9,10,SP,27,3,S,2119.15
10,11,SP,30,3,S,3326.79
11,12,SP,25,4,S,2684.05
12,13,SP,23,2,S,3507.84
13,14,SP,16,1,N,0.00
14,15,V,36,4,N,800.00

Como esse df é pequeno tudo bem chamar ele, agora qdo temos um df grande compensa olhar o head ou o tail para ver se importamos o dataframe corretamente e se está configurado os campos

In [4]:
df.head()

,ID,estado Origem,IDADE,escolaridade,Trabalha como Programadora,Renda Mensal
0,1,SP,36,4,S,3737.52
1,2,SP,25,2,N,400.00
2,3,MG,34,3,S,2366.14
3,4,RJ,23,3,S,2841.29
4,5,SP,31,4,N,800.00

In [5]:
df.tail()

,ID,estado Origem,IDADE,escolaridade,Trabalha como Programadora,Renda Mensal
10,11,SP,30,3,S,3326.79
11,12,SP,25,4,S,2684.05
12,13,SP,23,2,S,3507.84
13,14,SP,16,1,N,0.00
14,15,V,36,4,N,800.00

Podemos também querer saber quantas linhas há em um dataframe, por isso usamso o comando len()

lembrando que: len() returns the number of elements in the list.(https://www.tutorialspoint.com/python/list_len.htm)

In [6]:
len(df)

15

Eu quero saber quais são as colunas criadas desse dataframe, para isso eu uso o comando columns() - isso é ótimo para dataframes grandes

In [7]:
df.columns

Index(['ID', 'estado Origem', 'IDADE', 'escolaridade',
       'Trabalha como Programadora', 'Renda Mensal'],
      dtype='object')

Antes de manipular dados de uma coluna é interessante saber qual o tipo de dado que está inserido na coluna. Para isso usamso o type ou dtype.

In [8]:
df['Renda Mensal'].dtype

dtype('float64')

Podemos  fazer várias operações matemáticas com as colunas usando comandos, conforme abaixo:

sum()- soma
mean () - média

In [9]:
df['Renda Mensal'].sum()

34810.15

Agora se quisermos armazenar em uma variável esse valor, para depois printar bonitinho na tela, preciasmos informar que estamos usando um Pandas para fazer a conta usando o pd.series() 

para saber sobre pd.series = https://pandas.pydata.org/pandas-docs/stable/dsintro.html

In [10]:
soma_RM = pd.Series(df['Renda Mensal']).sum()
print("A soma dos Rendimentos Mensais é de: R$", (soma_RM))

A soma dos Rendimentos Mensais é de: R$ 34810.15

Podemos calcular a média usando o mean() e para delimitar a quantidade de zeros usamos:

"%. xf" % - onde o x é a quantidade de casas decimais

In [11]:
print("A média dos rendimenos é de:R$", "%.2f" % df['Renda Mensal'].mean()) # delimitando

A média dos rendimenos é de:R$ 2320.68

In [12]:
print("A média dos rendimenos é de:R$", df['Renda Mensal'].mean()) # sem delimitação

A média dos rendimenos é de:R$ 2320.6766666666667

Nós queríamos ver a média de rendimentos mensais quando as participantes são programadoras e não programadoras. Por isso criamso um view de um dataframe para trabalharmos apenas com as colunas que desejamos.

In [13]:
df2=df[['Trabalha como Programadora','Renda Mensal']]

In [14]:
df2.head()

  Trabalha como Programadora  Renda Mensal
0                          S       3737.52
1                          N        400.00
2                          S       2366.14
3                          S       2841.29
4                          N        800.00

Eu quero visualizar uma tabela que me permita ver a soma de valores por categoria (Trabalha como programadora). Para isso usamos o groupby (https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.groupby.html) + as funções que desejarmos, conforme exemplos:

In [15]:
df2.groupby(['Trabalha como Programadora']).sum()

                            Renda Mensal
Trabalha como Programadora
N                                2000.00
S                               32810.15

In [16]:
df2.groupby(['Trabalha como Programadora']).mean()

                            Renda Mensal
Trabalha como Programadora
N                             500.000000
S                            2982.740909

Agora se eu quero saber quantas meninas programam ou não eu posso usar um groupby() + a função count(), como abaixo:

In [17]:
df2.groupby(['Trabalha como Programadora']).count()

                            Renda Mensal
Trabalha como Programadora
N                                      4
S                                     11

Posso também querer ver tudo isso em uma única lista, para tal eu uso a junção .agg() que agrega tudo (agg é abrevição de agregation)

link: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.core.groupby.DataFrameGroupBy.agg.html

In [18]:
df2.groupby(['Trabalha como Programadora']).agg(['count','sum','mean'])

                           Renda Mensal
                                  count       sum         mean
Trabalha como Programadora
N                                     4   2000.00   500.000000
S                                    11  32810.15  2982.740909

A média é a soma de todos os valores, sendo dividido pelo número de linhas. Por isso uma linha zerada pode causar um "erro" na interpretação do dado. Para isso é importante analisar se há zeros ou linhas em branco no dataframe.

Para encontrar "células" em branco, nós podemos usar o comando isnull(), como no exemplo

In [19]:
df2.isnull()

    Trabalha como Programadora  Renda Mensal
0                        False         False
1                        False         False
2                        False         False
3                        False         False
4                        False         False
5                        False         False
6                        False         False
7                        False         False
8                        False         False
9                        False         False
10                       False         False
11                       False         False
12                       False         False
13                       False         False
14                       False         False

Acima ele mostrou todos as linha do dataset, apotando que não há valores nulos. Porém se temos um dataframe grande é melhor usar o .any() para ele localizar em qual linha temos o valor nulo.

In [20]:
df2.isnull().any()

Trabalha como Programadora    False
Renda Mensal                  False
dtype: bool

Todos os campos estão preenchidos, porém podemos ter alguma célula preenchida com '0', para isso vamos verificar os campos criando um filtro

In [21]:
df2[(df2['Renda Mensal'] == 0)]

   Trabalha como Programadora  Renda Mensal
13                          N           0.0

Identificamos que temos uma pessoa com rendimento zerado, o que altera o valor da média. Podemos também fazer um sort_value() (organizar pro valores) que identificariamos se há zeros ou não.

In [22]:
df2['Renda Mensal'].sort_values()

13       0.00
1      400.00
4      800.00
14     800.00
9     2119.15
8     2359.28
2     2366.14
11    2684.05
6     2752.74
3     2841.29
10    3326.79
5     3433.02
12    3507.84
7     3682.33
0     3737.52
Name: Renda Mensal, dtype: float64

Depois disso queriamos ver a renda média por estado de origem e por escolaridade.
Para isso vamos dividir em duas etapas a confecação da resposta. 

1) Renda e estado de Origem - criamos um dataframe apenas com essas variáveis e epoisusamos um groupby + funções

In [23]:
df3 = df[['estado Origem','Renda Mensal']]

In [24]:
df3.tail()

   estado Origem  Renda Mensal
10            SP       3326.79
11            SP       2684.05
12            SP       3507.84
13            SP          0.00
14             V        800.00

In [25]:
df3.groupby(['estado Origem']).agg(['count', 'sum', 'mean'])

              Renda Mensal
                     count       sum      mean
estado Origem
MG                       1   2366.14  2366.140
PE                       1   3682.33  3682.330
RJ                       2   5200.57  2600.285
SP                      10  22761.11  2276.111
V                        1    800.00   800.000

2) Renda e escolaridade - criamos um dataframe apenas com essas variáveis e epoisusamos um groupby + funções

In [26]:
df4 = df[['escolaridade','Renda Mensal']]

In [27]:
df4.head()

   escolaridade  Renda Mensal
0             4       3737.52
1             2        400.00
2             3       2366.14
3             3       2841.29
4             4        800.00

In [28]:
df4.groupby(['escolaridade']).agg(['count','sum', 'mean'])

             Renda Mensal
                    count       sum         mean
escolaridade
1                       1      0.00     0.000000
2                       2   3907.84  1953.920000
3                       6  16694.98  2782.496667
4                       4   8021.57  2005.392500
5                       2   6185.76  3092.880000

Para compreendermos melhor o resultado podemos subistituir neste dataframe os valores do campo escolaridade (como no dicionário de dados). Para isso usamos o comando .replace

replace = The method replace() returns a copy of the string in which the occurrences of old have been replaced with new, optionally restricting the number of replacements to max. (https://www.tutorialspoint.com/python/string_replace.htm)

In [34]:
df4['escolaridade']=df4['escolaridade'].replace({1:'Ensino Médio Completo', 2: 'Graduanda', 
                                                 3:'Graduada',4:'Pós Graduanda',5:'Pós Graduada'})

C:\Users\patricia\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

Ao alterarmos um campo dentro do dataframe criado o Python nos informa que isso não é uma boa prática pois criamos "novos valores" dentro de uma "cópia" de dataframe.

In [31]:
df4.head()

    escolaridade  Renda Mensal
0  Pós Graduanda       3737.52
1      Graduanda        400.00
2       Graduada       2366.14
3       Graduada       2841.29
4  Pós Graduanda        800.00

In [32]:
df4.groupby(['escolaridade']).agg(['count','sum', 'mean'])

                      Renda Mensal
                             count       sum         mean
escolaridade
Ensino Médio Completo            1      0.00     0.000000
Graduada                         6  16694.98  2782.496667
Graduanda                        2   3907.84  1953.920000
Pós Graduada                     2   6185.76  3092.880000
Pós Graduanda                    4   8021.57  2005.392500

Como podemos saber a idade média das meninas? Para isso usaremos a mediana, que nos dará a idade do meio de todas as meninas. Matematicamente nós deveriamos organizar o dataframe pela idade das meninas usando o sort_value() e ai sim calculariamos o valor da mediana.

In [35]:
df.columns

Index(['ID', 'estado Origem', 'IDADE', 'escolaridade',
       'Trabalha como Programadora', 'Renda Mensal'],
      dtype='object')

In [38]:
df['IDADE'].sort_values()

13    16
3     23
12    23
7     24
1     25
11    25
9     27
8     29
10    30
4     31
2     34
5     34
0     36
14    36
6     39
Name: IDADE, dtype: int64

Realizando o cálculo na mão nós teríamos a mediana em 29. Porém, podemos fazer isso automaticamente usando o comando median(), conforme abaixo.

In [39]:
df['IDADE'].median()

29.0

A mediana também é interessante quando trabalhamos com dados qualitativos!
Como entendemos qual a tendência central da Escolaridade, por exemplo? 
Para respondermos essa pergunta precisamos:
1º passo) Contar a frequência de cada uma das classes;
2º passo) Calcular a frequência acumulada;
3º passo) Selecionar o valor mediano dos dados.

O desafio é mostrar tudo isso em uma tabela de forma clara, já que não temos isso aqui... 

Como fizemos?

In [44]:
frequencia = df['escolaridade'].value_counts().sort_index()
acumulada = df['escolaridade'].value_counts().sort_index().cumsum()
df_freq_acu = pd.DataFrame (list(zip(list(frequencia.index),list(frequencia.values),list(acumulada.values))),
                                 columns = ['Escolaridade','Frequencia','Frequencia Acumulada'])
df_freq_acu['Escolaridade'] = df_freq_acu['Escolaridade'].replace({1:'Ensino Médio Completo', 2: 'Graduanda', 3:'Graduada',
                                                4:'Pós Graduanda',5:'Pós Graduada'})
df_freq_acu

            Escolaridade  Frequencia  Frequencia Acumulada
0  Ensino Médio Completo           1                     1
1              Graduanda           2                     3
2               Graduada           6                     9
3          Pós Graduanda           4                    13
4           Pós Graduada           2                    15

usamos o zip, como um zipper, juntando os dados de uma lista e outra para criarmos um dataframe. 

The zip() function take iterables (can be zero or more), makes iterator that aggregates elements based on the iterables passed, and returns an iterator of tuples.  (https://docs.python.org/3.3/library/functions.html#zip)